#include <stdio.h>
#include <string.h>
//字符串处理练习-统计句子里的单词数
main()
{
	int y=0 , i , x=0 ;  //别忘了初始化该初始化的值
	char a[10000] ;
	puts("请输入一句话：") ;
	gets(a) ;
	for ( i=0 ; a[i]!='\0' ; i++ )  //可通过判断是否到达空字符(\0)来判断是否判断完，要加单引号
	{
		if ( x==0 && ( ( a[i]>='0' && a[i]<='9' ) || ( a[i]>='A' && a[i]<='Z' ) || ( a[i]>='a' && a[i]<='z' ) ) )  //"\0"是空字符而非空格；"0"是空值(null)的ASCII码值而非空格的；空格是ASCII码值为32而非0，判断可用“' '”表示空格；别忘了判断是否相等用的是两个等号
		{
			y++ ;
			x = 1 ;
		}
		if ( ( a[i]<'0' ) || ( a[i]>'9' && a[i]<'A' ) || ( a[i]>'Z' && a[i]<'a' ) || ( a[i]>'z') )
		{
			x = 0 ;
		}
	}
	printf ( "单词数为%d\n" , y ) ;

	char b[10000] ;
}
