#include <stdio.h>
#include <math.h>
//ÌâÄ¿£º·ÖÊý°´A£¨90-100£©,B£¨80-89£©,C£¨70-79£©,D£¨60-69£©,E£¨²»¼°¸ñ£©Îå¼¶¼Æ·Ö£¬±àÐ´³ÌÐò,ÊäÈëÈÎÒâµÄ·ÖÊý£¬´òÓ¡ÏàÓ¦µÄµÈ¼¶£¬Èç¹ûÊäÈëµÄ·ÖÊý>100»òÕß<0£¬Ôò´òÓ¡³ö´í¡£
int main()
{
	double i ;
	printf ("请输入分数：");
	scanf ( "%lf" , &i );
	if ( 90 <= i <= 100 )
	{
		printf ("您的等级为A\n");
	}
	if ( i >= 80 && i <= 89 )
	{
		printf ("您的等级为B\n");
	}
	if ( i >= 70 && i <= 79 )
	{
		printf ("您的等级为C\n");
	}
	if ( i >= 60 && i <=69 )
	{
		printf ("您的等级为D\n");
	}
	if ( i >= 0 && i <= 59 )
	{
		printf ("您的等级为E\n");
	}
	if ( i > 100 || i < 0 )
	{
	printf ("Error!\n");
	}
	return 0;
}
