#include <stdio.h>
//编写程序，输入任意10个字符，统计小写字母、大写字母、数字字符、标点符号（只统计英文的逗号、句号）各有几个
main()
{
	int i , x=0 , d=0 , s=0 , b=0 ;  //注意数组下标须为整型
	char a[10] ;  //注意定义数组须定义为a[10]而非a[i]
	printf("请连续输入字符（勿以空格间隔）：");
	for ( i=0 ; i<10 ; i++ )
	{
		scanf ("%c" , &a[i] );  //注意输入字符是用%c

		if ( a[i]>='a' && a[i]<='z' ) { x++ ; }
		if ( a[i]>='A' && a[i]<='Z' ) { d++ ; }
		if ( a[i]>='0' && a[i]<='9' ) { s++ ; }
		if ( a[i]==',' || a[i]=='.' ) { b++ ; }
	
	}
	printf ("其中小写字母有%d个，大写字母有%d个，数字字符有%d个，标点符号有%d个\n" , x,d,s,b );
}
